[{"site_name":"Xenia","url":"https://www.ci.xenia.oh.us/bids.aspx?bidID=98","title":"2023 Bellbrook Avenue Resurfacing Project from Allison Ave to Second St","login_required":false,"payment_required":false,"open_date":"1/17/2023","open_timestamp":1673971200,"close_date":"2/7/2023","close_timestamp":1675756800,"state":"OH","agency":"City of Xenia","description":"The City is soliciting bids for the project known as the 2023 Bellbrook Ave Resurfacing Project from Allison Ave to Second St. PID#117013.Sealed bids to provide all necessary labor, equipment and materials needed to mill and resurface Bellbrook Ave., Xenia, Ohio from Allison Ave. to Second St. as directed by the City Engineer and in accordance with the General Conditions, Specifications, Required Contract Provisions, and Plans and/or Drawings included in the bid packet will be received in the Office of the City Clerk, 107 E Main St., Xenia, Ohio 45385 until Tuesday, February 7, 2023 at 2:30 p.m. To view the legal ad, please click here."},{"site_name":"Xenia","url":"https://www.ci.xenia.oh.us/bids.aspx?bidID=100","title":"2023 E Market St ADA Ramp Project","login_required":false,"payment_required":false,"open_date":"1/17/2023","open_timestamp":1673971200,"close_date":"2/7/2023","close_timestamp":1675756800,"state":"OH","agency":"City of Xenia","description":"The City is Soliciting bids for the project known as the 2023 E. Market St. ADA Ramp Project. Sealed bids to provide all necessary labor, equipment and materials to remove and replace existing ADA Ramps to meet ADA Compliance on E. Market St., Xenia, Ohio as directed by the City Engineer and in accordance with the General Conditions, Specifications, Plans and/or Drawings included in the bid packet will be received in the Office of the City Clerk, 107 E. Main St., Xenia, Ohio 45385 until Tuesday, February 7, 2023 at 2:00 p.m.To view the legal ad, please click here. "},{"site_name":"Xenia","url":"https://www.ci.xenia.oh.us/bids.aspx?bidID=99","title":"2023 N Detroit Street Resurfacing Project from Kinsey Rd to Church St","login_required":false,"payment_required":false,"open_date":"1/17/2023","open_timestamp":1673971200,"close_date":"2/7/2023","close_timestamp":1675756800,"state":"OH","agency":"City of Xenia","description":"The City is soliciting bids for the project known as the 2023 N. Detroit St. Resurfacing Project from Kinsey Rd. to Church St. PID#110506.Sealed bids to provide all necessary labor, equipment and materials needed to mill and resurface N. Detroit St., Xenia, Ohio from Kinsey Rd. to Church St. as directed by the City Engineer and in accordance with the General conditions, Specifications, Required Contract Provisions, and Plans and/or Drawings included in the bid packet will be received in the Office of the City Clerk, 107 E. Main St., Xenia, Ohio 45385 until Tuesday, February 7, 2023 at 2:15 p.m.To view this legal ad, please click here. "}]