[{"site_name":"LaCrosseWI","url":"https://www.cityoflacrosse.org/Home/Components/RFP/RFP/42/27?selsta=4","title":"HOME CHDO","login_required":false,"payment_required":false,"open_date":"3/21/2023","open_timestamp":1679410020,"close_date":"5/16/2023","close_timestamp":1684209600,"state":"WI","agency":"City of La Crosse","description":"https://www.cityoflacrosse.org/your-government/departments/planning-development-assessment/home-chdo"},{"site_name":"LaCrosseWI","url":"https://www.cityoflacrosse.org/Home/Components/RFP/RFP/36/27?selsta=4","title":"2012 Bicycle and Pedestrian Master Plan Update: Request for Proposals","login_required":false,"payment_required":false,"open_date":"12/14/2022","open_timestamp":1671029940,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"WI","agency":"City of La Crosse","description":"January 13, 2023 To Whom It May Concern: The City of La Crosse has received a Transportation Alternatives Program Grant from the Wisconsin Department of Transportation to update the 2012 Bicycle and Pedestrian Master Plan. Enclosed is a Request for Proposal issued by the City of La Crosse Planning, Development, and Assessment Department. The RFP contains information and guidelines for submittal along with the City’s Standard Contract Terms and Conditions. The RFP provides the information needed for you to determine your interest in the project and assures an equitable process. Please make sure you read through all documents thoroughly before submitting your proposal. Proposals must be submitted digitally to the City of La Crosse Planning, Development, and Assessment Department no later than 5:00 P.M. on Monday, February 6, 2023. We hope you find our project of interest and if there are any questions during the submittal process please contact me at dinkelj@cityoflacrosse.org or (608) 789-8676. We look forward to reviewing your proposals! Sincerely, Jenna Dinkel Associate Planner City of La Crosse Planning, Development, and Assessment FULL RFP"},{"site_name":"LaCrosseWI","url":"https://www.cityoflacrosse.org/Home/Components/RFP/RFP/34/27?selsta=4","title":"Downtown Tree Planting","login_required":false,"payment_required":false,"open_date":"12/5/2022","open_timestamp":1670255160,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"WI","agency":"City of La Crosse","description":"The City of La Crosse Parks, Recreation and Forestry Department is requesting proposals from qualified consulting firms to provide professional services to: Replace and revitalize the urban tree canopy in downtown La Crosse CONTACT INFORMATION Mailing Address: City of La Crosse Parks, Recreation & Forestry Department 400 La Crosse Street La Crosse, WI 54601 Staff Representative: Dan Trussoni, Parks, Forestry, Buildings and Grounds Manager Email: trussonid@cityoflacrosse.org Phone: 608-789-4915 Schedule December 1, 2022 Release of Request for Proposal January 20, 2023: Submittal Deadline - Proposals due by email TBD by Staff Award Notification DOWNLOAD PDF Request for Proposal The City of La Crosse is seeking proposals from qualified consultants to replace and revitalize the urban tree canopy in downtown La Crosse and other consultant services as specified in this RFP. The required services are described in the Scope of Services section. This set of services will be awarded to one consultant. The proposer is encouraged to suggest additions or modifications as suggested alternative options to the scope that will enhance or clarify the work, and these suggestions may be incorporated into the final contract. Background The City of La Crosse sits in the heart of an unglaciated area of the upper Midwest in La Crosse County, Wisconsin. La Crosse is a 25.4 sq. mile city and is home to over 50,000 residents. The downtown area of La Crosse houses approximately 12% of the City’s population and has much to offer including specialty shops, a variety of dining options, entertainment venues, and historic architecture. Downtown La Crosse holds about 1/3 of the city’s multifamily housing, 1/3 of the city’s retail, and just under half of the city’s offices. The urban tree canopy is essential to the City of La Crosse’s downtown infrastructure. Trees contribute to a person’s health and well-being in several ways. Among the many benefits included are: cleaner air quality, increased property values, overall improvement in mental health, and added aesthetic value. The larger the tree, the greater the benefits associated with it. One problem with urban trees is that oftentimes they are not offered ideal conditions for maximum growth, with soil compaction being one of the major factors. Due to unideal soil conditions, many urban trees will never reach their maximum growth potential and end up dying years before their intended lifespan. They typically end up being replaced by smaller trees and the cycle repeats itself. Installing soil cells or an alternative option upon the planting of young trees will encourage healthy and long-term growth. This will result in longer-lasting trees and much less of a need for replacement trees over time. The vision for La Crosse’s urban tree canopy is to have a variety of thriving and diverse species to maximize the potential lifespan and to offer the greatest possible benefits to the community for generations to come. Scope of Services The City of La Crosse would like to gradually replace the downtown boulevard trees with new trees with the addition of soil cells or a similar alternative to soil cells. Planting with soil cells will give the trees a greater chance to reach their maximum growth potential, thus increasing the overall benefits offered over time. The current area of focus is shown on the map below. The area includes all boulevard trees on: 5th Ave (both east and west sides of 5th Ave) from Cass St to State St 7th St (both east and west sides of 7th St) from Cass St to State St Cass St (both north and south sides of Cass St) from 3rd St to 7th St King St (both north and south sides of King St) from 5th Ave to 7th St Main St (both north and south sides of Main St) from 5th Ave to 7th St State St (both north and south sides of State St) from 5th Ave to 7th St The urban tree canopy is essential to the City of La Crosse’s downtown infrastructure. Trees contribute to a person’s health and well-being in several ways. Among the many benefits included are: cleaner air quality, increased property values, overall improvement in mental health, and added aesthetic value. The larger the tree, the greater the benefits associated with it. One problem with urban trees is that oftentimes they are not offered ideal conditions for maximum growth, with soil compaction being one of the major factors. Due to unideal soil conditions, many urban trees will never reach their maximum growth potential and end up dying years before their intended lifespan. They typically end up being replaced by smaller trees and the cycle repeats itself. Installing soil cells or an alternative option upon the planting of young trees will encourage healthy and long-term growth. This will result in longer-lasting trees and much less of a need for replacement trees over time. The vision for La Crosse’s urban tree canopy is to have a variety of thriving and diverse species to maximize the potential lifespan and to offer the greatest possible benefits to the community for generations to come. The City of La Crosse uses TreePlotter to document the location, diameter, condition, etc. of all boulevard trees. There are currently 84 boulevard trees in the area of focus, with only 6% exceeding 20” in diameter and 33% of the total trees on a serious decline due to poor structure or poor root systems. Additionally, 19% of the 84 trees have premature crown dieback, likely due to a lack of ideal soil conditions and nutrient availability. An assessment of the existing 84 trees should be completed to determine which trees require replacements with soil cells or an alternative option, which trees simply require replacement, and which trees may be acceptable to remain as is. The consultant must identify the specific needs of each existing tree located within the project area. The consultant may also propose new locations for additional trees to be planted. The plantings must comply with current city documents, including the Climate Action Plan, municipal codes, and the approved boulevard tree list. The goals of the Downtown Revitalization Project include: Use soil cells or alternative option upon planting to create an optimal growing environment that allows urban trees to reach their maximum growth potential and lifespan Improve the health and appearance of the urban tree canopy Maintain species diversity with no more than 30% of any one family, 20% of any one genus, and no more than 10% of any one species of tree Mitigate tree and infrastructure conflicts around streets, sidewalks, and utilities Required Provide City with complete bid specifications for public bidding process Construction Administration Attend public input session if necessary Integrate this project with other existing and upcoming City projects and plans (i.e. King Street Greenway, Cass Street Beautification, 2040 Downtown Plan, Urban Forestry Management Plan, etc.) Schedule of Anticipated Dates for Events and Deadlines - Subject to change RFP Issued – December 1, 2022 RFP Submission deadline – January 20, 2023 Assessment-April 2023 Bid-June 2023 Award-July 2023 Construction/Planting-September/October 2023 Proposal Submission Deadline & Requirements The deadline for submission of the proposal is January 20, 2023. Submit proposals by emailing Dan Trussoni at trussonid@cityoflacrosse.org To accurately compare consultant proposals, the City is requiring proposals to be submitted as follows: 1) Cover Letter – a letter of interest containing an introduction of your firm and summarizing key points of the proposal. (maximum 1 page) 2) Executive Summary – provide a brief description of your anticipated approach to this project. (maximum 2 pages) 3) Corporate Profile – (maximum 2 pages) Proposer identity (Corporation, Sole Proprietorship, etc.) Corporate History, Structure, and Background Location of Offices (list the office which will be the point of contact for this project) Staff overview – key personnel who will be assigned to the project 4) Similar Project Experience – projects of similar size and use (maximum 2 pages) 5) Project Approach – (maximum 4 pages) Scheduling/time-line Research and analysis Design Proposed budget should estimate each tree’s cost individually and as a complete sum. 6) Client References – provide up to three references on relevant projects. (maximum 1 page) Proposal Evaluation Proposals will be evaluated based on the quality of the proposal, experience and qualifications, references, and cost. Those submitting consultants determined to be best qualified to undertake the services required may be invited to make a presentation to the City’s interview team. The chosen consultant will be notified by the staff representative at an unspecified date. Selection Procedure All consultants that submit an RFP will be notified of the outcome following receipt of a signed contract. The City of La Crosse is not bound by the low bid/proposal in hiring a consultant. All prices, costs, and conditions outlined in the proposal shall remain fixed and valid for acceptance for 60 days starting on the due date for proposals. Consultant Contract The selected consultant shall provide a contract for services and a certificate of insurance to be completed prior to work beginning on the project. Insurance Requirements The proposer who is awarded a contract shall be expected to provide proof of insurance coverage and name the City of La Crosse as additional insured. Proof of insurance should include liability coverage. INSURANCE. Contracting Party shall, at its sole expense, obtain and maintain in effect at all times during this Agreement the following insurance coverage: 1)Commercial General Liability Insurance of not less than $1,000,000.00 per occurrence for bodily injury, personal injury and property damage; 2)Automobile Liability Insurance of not less than $1,000,000.00 per occurrence for bodily injury and property damage covering all vehicles to be used in relation to this Agreement; 3)Umbrella Liability Insurance of not less than $1,000,000.00 per occurrence for bodily injury, personal injury and property damage in excess of coverage carried for commercial general liability and automobile liability; 4)Professional Liability Insurance of not less than $1,000,000.00 per claim and annual aggregate; and 5)To the extent that Contracting Party employs any employees or as otherwise required by law, Workers’ Compensation and Employees’ Liability Insurance with Wisconsin statutory limits. On the certificate of insurance, La Crosse shall be named as an additional insured on any General Liability Insurance, Automobile Insurance, and Umbrella Liability Insurance. The certificate must state the following: The City of La Crosse, its officers, agents, employees, and authorized volunteers shall be Additional Insureds. Prior to execution of the Agreement, Contracting Party shall file with La Crosse, a certificate of insurance signed by the insurer’s representative evidencing the coverage required by this Agreement. Such evidence shall include an additional insured endorsement signed by the insurer’s representative. Contracting Party shall provide La Crosse with a thirty (30) day notice prior to termination or cancellation of the policy. La Crosse reserves the right to require review and approval of the actual policy of insurance before it executes this Agreement. Additional Information The City will provide any necessary public utility data upon request. Link to TreePlotter map of the area of focus: https://pg-cloud.com/LaCrosseWI/?scenario=downtowntreecanopyrevitalization1 Link to 2040 Downtown Plan: https://cityoflacrosse.legistar.com/View.ashx?M=F&ID=9708648&GUID=6ED8E431-228D-4ADA-BC4E-BF233358DD7D Link to King Street Greenway Project: https://www.cityoflacrosse.org/your-government/departments/planning-economic-development/planning/transportation/king-street-greenway-extension-project"},{"site_name":"LaCrosseWI","url":"https://www.cityoflacrosse.org/Home/Components/RFP/RFP/32/27?selsta=4","title":"COMMUNITY DEVELOPMENT BLOCK GRANT- SMALL BUSINESS ASSISTANCE","login_required":false,"payment_required":false,"open_date":"4/21/2022","open_timestamp":1650553920,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"WI","agency":"City of La Crosse","description":"https://www.cityoflacrosse.org/home/showpublisheddocument/6242/637861362973500000"},{"site_name":"LaCrosseWI","url":"https://www.cityoflacrosse.org/Home/Components/RFP/RFP/8/27?selsta=4","title":"REQUEST FOR PROPOSALS FOR BANK DIRECT PURCHASE PROPOSALS AND/OR SENIOR MANAGING UNDERWRITER","login_required":false,"payment_required":false,"open_date":"3/18/2021","open_timestamp":1616069460,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"WI","agency":"City of La Crosse","description":"https://www.cityoflacrosse.org/home/showpublisheddocument/4833/637516518592930000"}]