[{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=20220136%20(MCC%207360)","title":"Culvert Replacement at SW 132 Ave and C-100 Canal","login_required":false,"payment_required":false,"open_date":"4/12/2023","open_timestamp":1681322400,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"Work under this Contract includes furnishing of all supervision, labor, materials, tools, equipment and performing all operations required to replace in-kind of an existing 17 feet diameter culvert. Contractor to comply with all the requirements from South Florida Water Management District (SFWMD). LOCATION OF WORK: A. The location of work to be performed under the terms of this Contract shall be as follows: 1. At SW 132 Avenue and C-100 Canal. B. The exact location and limits of construction are as shown on the Plans accompanying these Contract Documents."},{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=20220141%20(MCC%207360)","title":"Intersection Improvement  at SW 57 Ave. and SW 72 St.","login_required":false,"payment_required":false,"open_date":"4/5/2023","open_timestamp":1680717600,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"Work under this contract includes but is not limited to providing the supervision, labor, required materials, equipment, tools, operations and documentation for implement a diagonal/scramble crosswalk at the intersection of SW 57 Avenue and SW 72 Street to allow pedestrians to cross in multiple directions and increase visibility of the crossing space, pursuant to the requirements of the Contract Documents. This project is subject to the criteria and conditions of federal funded projects. LOCATION OF WORK: SW 57 Ave. and SW 72 St."},{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=20230004%20(MCC%207360)","title":"Venetian Causeway Bridges No. 874459 and No. 874474 - Hurricane Irma Repairs","login_required":false,"payment_required":false,"open_date":"4/5/2023","open_timestamp":1680717600,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"Work under this Contract includes furnishing of all supervision, labor, materials, tools, equipment and performing all operations required to construct the Work in accordance with the Contract Documents. Tasks to be performed includes, but is not limited to the following: • Remove components from the existing damaged timber fender system including, wales, spacer blocks, catwalk planks, deck supports, all associated connections and wire ropes, and install new wales, spacer blocks, catwalk planks, deck supports, wire ropes and handrail at both bridges. • Remove and replace fender navigational light system at both bridges. • Remove and replace existing damaged ladders platforms at both bridges. • Remove and replace existing damaged roof tiles at both bridge tender houses. Care to be taken not to allow any damaged tile to fall into water or adjacent sidewalk area. Damaged tile not eligible for repair to be disposed of in accordance with plans. • Remove and replace bitumen roof at the East Bridge Generator Building. • Repair spalls with exposed reinforcing as per specifications and plans at existing fender concrete piles, at both bridges. • Repair spalls with exposed reinforcing as per specifications and plans and repair concrete deck slab spalls at the East Bridge Generator Building. • Repair existing walls, clean and paint the exterior walls and steel gate at the East Bridge Generator Building. A. The location of work to be performed under the terms of this Contract shall be as follows: 1. Bridge No. 874459 (Venetian West Bascule) and Bridge No. 874474 (Venetian East Bascule) at the Fender System, Tender Houses and the East Bascule Generator House. B. The exact location and limits of construction are as shown on the Plans accompanying these Contract Documents."},{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=20230030%20(MCC%207360)","title":"Guardrail Multiple Sites","login_required":false,"payment_required":false,"open_date":"4/19/2023","open_timestamp":1681927200,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"Work under this Contract includes furnishing of all supervision, labor, materials, tools, equipment and performing all operations required to construct the Work in accordance with the Contract Documents. Work includes but is not limited to replacement of guardrail posts, remove, repair or replace damaged or destroyed sections of guardrail, realigning of panels, posts, blocks and anchorages, and miscellaneous hardware. Removal of existing guardrail, construction of metal guardrail on posts of timber or steel, construction of guardrail anchorages. Location of Work: This is a work driven contract. The actual location(s) of work shall be identified in the Work Order(s) issued subsequent to the Award of the Contract. The combined total cost for all work authorized by the Work Order(s) shall not exceed the Contract Award amount. The Department does not guarantee that the full amount of the Contract will be issue to the Contractor. The actual amount of Work orders assigned will be the prerogative of the department in its sole discretion and dependent only upon its needs."},{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=MCC%207360%20RPQ%202020-004.02","title":"Shore Power Duct Bank - West","login_required":false,"payment_required":false,"open_date":"3/31/2023","open_timestamp":1680285600,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"The Contractor shall furnish all materials (except owner provided), labor, services, supervision, tools, equipment, and all other items for the construction and installation of concrete encased duct banks and manhole structures, located at Miami-Dade County Seaport Department. The project consists of, but not limited to: • Contractor shall provide all labor, tools, materials (except owner provided), equipment, and incidentals necessary for the complete, functional, and satisfactory construction and installation of Port Miami’s Concrete Encased Duct Banks and manhole structures via regular excavation and directional bore, proposed 2-2” communication conduits, Florida, Power & Light Duct Banks and manhole structures as shown on construction drawings, approved permits and in compliance all applicable regulatory standards and requirements. • Contractor shall provide all labor, tools, materials (except owner provided), equipment, and incidentals necessary for the complete, functional, and satisfactory construction of trench restoration on the roadway(s) and site including all necessary pavement removal, excavation, embankment, pavement construction; signing and pavement marking; signs; tree removal, temporary maintenance of traffic, and any supportive ancillary tasks to successfully complete all elements of the project as shown on construction drawings, approved permits and in compliance all applicable regulatory standards and requirements. All work shall be performed in accordance with the Contract Documents. BID DOCUMENTS: Documents are being sent via email from Port-Miami, Contracts, Procurement, and Materials Management Section, 1007 North America Way, Suite 311, Miami, Florida 33132. Contractor must refer to the Request for Price Quotation (RPQ) and associated project specifications for the detail Scope of Work."},{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=MCC%207360%20RPQ%20C22-CUA-Caleb-BOH","title":"JOSEPH CALEB AUDITORIUM EXPANSION","login_required":false,"payment_required":false,"open_date":"4/10/2023","open_timestamp":1681153200,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"The Project consists of the New Construction and expansion of a approx. 4,300 square foot back-of-house, one-story addition to the Joseph Caleb Auditorium, creating additional dressing rooms, restrooms and showers, storage space, offices, an expanded green room, laundry facilities, a technical staff break room, and an expanded loading area directly adjacent to the main stage of the auditorium.?On site driveway improvements to the approach of the new loading dock area will provide a more direct access for trucks to reach the facility and increase load-in and out productivity. BIDDER’S QUALIFICATIONS AND RESPONSIBILITY: Bidders must meet the following minimum qualifications and responsibility requirements: The selected contractor or primary principals of the company must demonstrate active experience in the construction industry for at least ten (10) years prior to submittal. The selected contractor or primary principals and/or senior management must demonstrate experience as a prime contractor responsible for the construction of one (1) facility of comparable or greater size, complexity, quality, value, type and scale within the past ten (10) years. Contractor or its consultant must demonstrate experience with sustainability and/or resiliency projects and the fulfillment of the requirements for attaining building certification as required by the sustainability rating system. Bidders must fill out and include in their bid submissions a Bidder’s Qualification Form in order to provide information about the project(s) being submitted for consideration to substantiate the experience required, Reference Section 00 45 13.? Bidders are required to include in their bid submissions general information regarding their companies’ management and operations, financial resources, bonding capacity, payment history to subcontractors, and a history of commenced and completed projects in order to support said requirements. Any and all documentation submitted to support these requirements will be subject to verification by County staff. The determination of the companies and/or individual's qualifications and compliance with the above experience and qualifications shall be at the sole discretion of the County. Contractor must refer to the Request for Price Quotation (RPQ) and associated project specifications for the detail Scope of Work."},{"site_name":"MiamiDadeCoFL","url":"https://www.miamidade.gov/apps/ISD/stratproc/Home/SolicitationDetails?solNumber=MCC%207360%20RPQ%20ZC2023MD","title":"Zoo Miami - Monorail Removal and Renovation","login_required":false,"payment_required":false,"open_date":"3/28/2023","open_timestamp":1680026400,"close_date":"12/31/2099","close_timestamp":4102376400,"state":"FL","agency":"Miami-Dade County","description":"CONTRACTOR shall review all documents, specifications, plans, surveys, testing reports and scope of work provided by Miami-Dade County Parks, Recreation, and Open Spaces Department for Zoo Miami - Monorail Removal and Renovation work to be completed. Furnish all labor, equipment, and materials required to comply with the intent of the WORK described in the contract documents including but not limited to: 1) Demolition and removal of the Zoo Monorail Guideway and Facilities. Renovate existing Monorail Barn. Erect a 6’ temporary chain link construction fence around stations being worked on prior to Demolition. Include green windscreen and maintain throughout project. 2) Provide temporary toilet facilities for workers throughout duration of project. 3) Provide shop drawings as required by Architect of Record. 4) Complete all installations per attached Plans and Specifications. 5) Install concrete per plans. Design mix to include the following minimum specifications: 5000 psi, fiber- enriched, and Xypex or approved waterproofing agent. 6) Include the installation of (WMMR) stucco on Masonry Walls. Include coating the walls with high performance 2-part urethane primer and 2 top coats of 2-part urethane paint. 7) Fill all Masonry Wall cells with concrete. 8) Should any concrete crack during construction, or within the one-year construction warranty appear in newly installed areas, the crack will be repaired by epoxy injection. Product and method to be approved by owner. 9) All Metals and Caging shall be prefabricated and Galvanized after Weld (GAW) as much as the project allows for. The intent is to create the best rust-free enclosure as is possible. Hot-Dipped Galvanizing shall achieve a G90 specification. Metal Shop Drawings to be approved by owner and AOR. 10) The Project will be scheduled and phased according to plans. It is the responsibility of the Contractor to verify all pricing and to modify their adjustment factors accordingly to inflation or material cost fluctuations prior to submitting a final Base Bid price. Failure to honor pricing could impact the ability of the firm to receive County Business in the future as it will become a responsibility issue in future evaluations. Experience Requirement: Bidder or vendor key personnel experience shall have completed at least two (2) projects of similar size and scope in accordance with Resolution No. R-1122-21. Bidder shall provide evidence of this experience; project names; dollar values and contract information for verification purposes. The experience of the bidding or proposing Contractors’ key personnel will be considered in assessing the Contractor’s experience. This information should be entered on form 00450 Bidder's Statement of Qualifications and Business References, highlighting at least two comparable projects and using additional pages as needed. BID DOCUMENTS: To receive the bid documents contact Jeffery Becar jeffery.becarcavero@miamidade.gov via email. A full bid package of the Bid Documents must be requested directly from the Parks, Recreation and Open Spaces Department or your bid will be deemed non-responsive. Bid Documents will be available on: February 23, 2023. Contractor must refer to the Request for Price Quotation (RPQ) and associated project documents for the detail Scope of Work."}]