[{"site_name":"NaplesFL","url":"https://www.naplesgov.com/purchasing/page/23-014-wastewater-treatment-plant-wwtp-generator-installation-electrical","title":"23-014 WASTEWATER TREATMENT PLANT (WWTP) GENERATOR INSTALLATION & ELECTRICAL IMPROVEMENTS - ITB","login_required":false,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"3/30/2023","close_timestamp":1680148800,"state":"FL","agency":"City of Naples","description":"This project will replace the two existing stand-alone generators with four generators connected in parallel. The generators, generator platform, and generator remote-mounted annunciators will be provided by the CITY. It is the City’s Intent to Invite the Awarded Firms from RFQ 23-006 to submit a Bid in response to this Invitation To Bid. A site visit to the Wastewater Plant located at 1400 3rd Avenue North will take place directly after the Mandatory Pre-Bid. Prospective Bidders are strongly encouraged to attend since the Wastewater Plant is a fenced/secured area and this will be their only opportunity to access it."},{"site_name":"NaplesFL","url":"https://www.naplesgov.com/purchasing/page/23-021-lab-testing-services-rfp","title":"23-021 Lab Testing Services - RFP","login_required":false,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"4/4/2023","close_timestamp":1680580800,"state":"FL","agency":"City of Naples","description":"The City of Naples desires to enter into a contractual relationship with vendors capable of providing TNI (The NELAC Institute) certified lab testing services for soil, potable and non-potable matrices. It is the City’s intent to award to multiple vendors and to designate vendors in terms of primary service providers and standby service providers."},{"site_name":"NaplesFL","url":"https://www.naplesgov.com/purchasing/page/23-018-oyster-reef-restoration-project-site-2-rfp","title":"23-018 OYSTER REEF RESTORATION PROJECT SITE 2 - RFP","login_required":false,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"4/11/2023","close_timestamp":1681185600,"state":"FL","agency":"City of Naples","description":"The City of Naples is soliciting proposals to construct ten oyster reefs in Naples Bay, Florida. Contractors and/or consulting firms qualified and experienced in marine engineering, water resources, and environmental restoration will be considered for award of this Request for Proposals (RFP)."}]