[{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=167660","title":"RFP #23-0015 - Community Housing Development Organization (CHDO) Affordable Housing Development","login_required":true,"payment_required":false,"open_date":"1/22/2023","open_timestamp":1674363600,"close_date":"3/24/2023","close_timestamp":1679630400,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that the City of Richland, Washington has issued the above solicitation for the development of affordable housing by either a non-profit, public housing authority or a certified Community Housing Development Organization (CHDO) as defined by the U.S. Department of Housing and Urban Development (HUD). Federal laws and regulations described in 24 CFR, Part 92 are required. Respondents who are Minority-owned and Women-owned Business Enterprises or Section 3 Business Enterprises are encouraged to submit proposals. These entities must have the capacity to develop affordable, single-family or multi-family housing for rental or homebuyer activities. The City of Richland assures that no person shall on the grounds of race, color, national origin, or sex as provided by Title VI of the Civil Rights Act of 1964, as amended, and the Civil Rights Restoration Act 1987 (P.L. 100.259), be excluded from participation in, be denied the benefits of, or be otherwise subjected to discrimination under any City sponsored program or activity. The City of Richland further assures every effort will be made to ensure nondiscrimination in all of its programs and activities, whether those programs and activities are federally funded or not. Americans with Disabilities Act (ADA) Information The City of Richland in accordance with Section 504 of the Rehabilitation Act (Section 504) and the Americans’ with Disabilities Act (ADA), commits to nondiscrimination on the basis of disability, in all of its programs and activities. This material can be made available in an alternate format by emailing Heather Kintzley at hkintzley@ci.richland.wa.us or by calling 509-942-7385."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170018","title":"RFQ #23-0029 - Engineering Services Design and Inspection Work for Electrical Distribution Substations-Expansion & Rebuild","login_required":true,"payment_required":false,"open_date":"3/12/2023","open_timestamp":1678597200,"close_date":"3/27/2023","close_timestamp":1679889600,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that the City of Richland, Washington has issued the above solicitation engineering services for design and inspection work to replace and reconfigure two banks at two different electrical distribution substations, including expansion at both sites. Included herein is a call for qualifications for consultants and general requirements. Detailed information and the submittal documents are available at www.publicpurchase.com , under City of Richland, Washington designated webpage. The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 USC 2000d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, Subtitle A, Office of the Secretary, Part 21, Nondiscrimination in Federally Assisted Programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color national origin, or sex in consideration for an award. Americans with Disabilities Act (ADA) Information The City of Richland in accordance with Section 504 of the Rehabilitation Act (Section 504) and the Americans’ with Disabilities Act (ADA), commits to nondiscrimination on the basis of disability, in all of its programs and activities. This material can be made available in an alternate format by emailing Heather Kintzley at hkintzley@ci.richland.wa.us or by calling 509-942-7384."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=169462","title":"ITB #23-0012 - Stevens Drive Pavement Preservation - Rebid","login_required":true,"payment_required":false,"open_date":"3/5/2023","open_timestamp":1677992400,"close_date":"3/28/2023","close_timestamp":1679976000,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that bids will be received for the City of Richland’s STEVENS DRIVE PAVEMENT PRESERVATION REBID Project by the City of Richland Purchasing Division staff until the date and time specified above, at which time bids will be opened and read publicly. This project includes improvement of Stevens Drive between Jadwin and University via application of Type 3 microsurfacing for approximately 9000 linear feet (1.7 miles) including crack sealing, removal of striping, installation of new striping, upgrades to street signs, and ADA ramp upgrades and other incidental work in Richland, Washington. This project is estimated $860,000 to $1,200,000. The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 U.S.C. 200d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, subtitle A, Office of the Secretary, Part 21, nondiscrimination in federally assisted programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, national origin, or sex in consideration for an award."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170537","title":"ITB #23-0009 - 2023 Slurry Seal","login_required":true,"payment_required":false,"open_date":"3/21/2023","open_timestamp":1679371200,"close_date":"3/28/2023","close_timestamp":1679976000,"state":"LA","agency":"City of Monroe","description":"THIS REPLACES PREVIOUS BID THAT DID NOT ALLOW RESPONDENTS TO UPLOAD BID DOCUMENTS. Public notice is hereby given that sealed bids will be received for the City of Richland’s 2023 SLURRY SEAL Project by the City of Richland Purchasing Division until the date and time specified above, at which time bids will be opened and read publicly. This project provides for the construction of Type 2 and Type 3 emulsified asphalt slurry (approximately 250,000 square yards); traffic control, pavement marking removal and replacement; and other incidental work all in accordance with the Contract Plans, Contract Provisions, and the Standard Specifications. This project is estimated at $548,000 - $752,000 The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 U.S.C. 200d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, subtitle A, Office of the Secretary, Part 21, nondiscrimination in federally assisted programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, national origin, or sex in consideration for an award."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170543","title":"ITB #23-0010 - 2023 Microsurfacing Project","login_required":true,"payment_required":false,"open_date":"3/21/2023","open_timestamp":1679371200,"close_date":"3/28/2023","close_timestamp":1679976000,"state":"LA","agency":"City of Monroe","description":"THIS REPLACES PREVIOUS BID THAT DID NOT ALLOW RESPONDENTS TO UPLOAD BID DOCUMENTS. Public notice is hereby given that sealed bids will be received for the City of Richland’s 2023 MICROSURFACING Project by the City of Richland Purchasing Division until the date and time specified above, at which time bids will be opened and read publicly. This project includes construction of Microsurfacing, Type 3 (approximately 156,000 square yards); traffic control, removal of existing pavement markings, temporary pavement markings, permanent pavement markings, and other incidental work all in accordance with the Contract Plans, Contract Provisions, and the Standard Specifications. This project is estimated at $1,000,000 - $1,370,000 The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 U.S.C. 200d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, subtitle A, Office of the Secretary, Part 21, nondiscrimination in federally assisted programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, national origin, or sex in consideration for an award"},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=169365","title":"RFQ #23-0025 - USACE Storm Flow Analysis","login_required":true,"payment_required":false,"open_date":"2/28/2023","open_timestamp":1677560400,"close_date":"3/28/2023","close_timestamp":1679976000,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that the City of Richland, Washington has issued the above solicitation seeking statements of qualifications for updating the current stormwater runoff and peak discharge of the contributing drainage area as described in the Floodplain Study for Levee 2C - Interior Drainage (Hip Deep Creek). The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 USC 2000d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, Subtitle A, Office of the Secretary, Part 21, Nondiscrimination in Federally Assisted Programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color national origin, or sex in consideration for an award. Americans with Disabilities Act (ADA) Information The City of Richland in accordance with Section 504 of the Rehabilitation Act (Section 504) and the Americans’ with Disabilities Act (ADA), commits to nondiscrimination on the basis of disability, in all of its programs and activities. This material can be made available in an alternate format by emailing Heather Kintzley at hkintzley@ci.richland.wa.us or by calling 509-942-7385."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170331","title":"ITB #23-0024 - City-wide Wetland Maintenance Project","login_required":true,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"4/4/2023","close_timestamp":1680580800,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that bids will be received for the City of Richland’s CITY-WIDE WETLAND MAINTENANCE PROJECT by the City of Richland Purchasing Division until the date and time specified above, at which time bids will be opened and read publicly. The project consists of, but not limited to, furnishing all materials, labor, tools, and equipment necessary to perform the work required. The project consists of, but not limited to, furnishing all materials, labor, tools and equipment necessary to annually maintain, perform weed control, identify overall plant health, replace plans as necessary and manage irrigation on wetlands, per plans and specifications. Engineer's estimate: $76,000 to $101,000 The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 U.S.C. 200d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, subtitle A, Office of the Secretary, Part 21, nondiscrimination in federally assisted programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, national origin, or sex in consideration for an award. Small, Minority and Women-owned firms are encouraged to submit bid."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=169342","title":"ITB #23-0026 - Power Transformers New","login_required":true,"payment_required":false,"open_date":"3/5/2023","open_timestamp":1677992400,"close_date":"4/4/2023","close_timestamp":1680580800,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that the City of Richland, Washington has issued the above-mentioned invitation to bid to purchase two (2), three phase, three winding, outdoor, station type, oil-immersed, load-tap-changing power transformers. The City of Richland assures that no person shall on the grounds of race, color, national origin, or sex as provided by Title VI of the Civil Rights Act of 1964, as amended, and the Civil Rights Restoration Act 1987 (P.L. 100.259), be excluded from participation in, be denied the benefits of, or be otherwise subjected to discrimination under any City sponsored program or activity. The City of Richland further assures every effort will be made to ensure nondiscrimination in all of its programs and activities, whether those programs and activities are federally funded or not. Federal laws and regulations described in 2 CFR, Part 200 are required. Bidders who are Minority-owned and Women-owned Business Enterprises or Section 3 Business Enterprises are encouraged to submit bids."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=169671","title":"ITB #23-0027 - Metalclad Switchgear New","login_required":true,"payment_required":false,"open_date":"3/12/2023","open_timestamp":1678597200,"close_date":"4/4/2023","close_timestamp":1680580800,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that the City of Richland, Washington has issued the above-mentioned invitation to bid to purchase two (2), medium voltage metalclad switchgear assemblies containing draw-out power circuit breakers, non-draw-out switches and related equipment and devices. The medium voltage switchgear shall be housed in an aisle-way enclosure. The City of Richland assures that no person shall on the grounds of race, color, national origin, or sex as provided by Title VI of the Civil Rights Act of 1964, as amended, and the Civil Rights Restoration Act 1987 (P.L. 100.259), be excluded from participation in, be denied the benefits of, or be otherwise subjected to discrimination under any City sponsored program or activity. The City of Richland further assures every effort will be made to ensure nondiscrimination in all of its programs and activities, whether those programs and activities are federally funded or not. Federal laws and regulations described in 2 CFR, Part 200 are required."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170129","title":"ITB #23-0038 - WWTP Operations Building HVAC Upgrades","login_required":true,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"4/4/2023","close_timestamp":1680580800,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that bids will be received for the City of Richland’s WWTP OPERATIONS BUILDING HVAC UPGRADES by the City of Richland Purchasing Division until the date and time specified above, at which time bids will be opened and read publicly. The project consists of, but not limited to, furnishing all materials, labor, tools and equipment necessary to perform the work required for completing the installation of the HVAC upgrades at the City’s Wastewater Treatment Plant (WWTP). Engineer's estimate: $88,000 to $120,000 The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 U.S.C. 200d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, subtitle A, Office of the Secretary, Part 21, nondiscrimination in federally assisted programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, national origin, or sex in consideration for an award. Small, Minority and Women-owned firms are encouraged to submit bid. Pre-Bid Meeting : There is no scheduled pre-bid meeting for this project. Bidders wishing to view the WWTP site may do so by appointment only . Please contact Nick Blasdel by phone at 509-531-2804 to schedule."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170356","title":"ITB #23-0036 - 1344 Thayer Dr. Demolition & Site Remediation Project","login_required":true,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"4/11/2023","close_timestamp":1681185600,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that bids will be received for the City of Richland’s 1344 THAYER DR. DEMOLITION & SITE REMEDIATION Project by the City of Richland Purchasing Division until the date and time specified above, at which time bids will be opened and read publicly. This project includes but is not limited to the removal of an existing structure located at 1344 Thayer Drive that has endured structurally compromising fire damage and weather exposure. The demolition of the structure shall be in accordance with the provided AMOC work plan and Benton Clean Air approved demolition methods for a project of this category. All such demolition, identified debris, and site restoration shall be complete, as shown on the plans and specifications. This project is estimated at $95,000 to $130,000. The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 U.S.C. 200d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, subtitle A, Office of the Secretary, Part 21, nondiscrimination in federally assisted programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color, national origin, or sex in consideration for an award. Small, Minority and Women-owned firms are encouraged to submit bid."},{"site_name":"RichlandWA","url":"https://www.publicpurchase.com/gems/richland,wa/bid/bidView?bidId=170209","title":"RFP #23-0021 - Polygraph Services","login_required":true,"payment_required":false,"open_date":"3/19/2023","open_timestamp":1679198400,"close_date":"4/11/2023","close_timestamp":1681185600,"state":"LA","agency":"City of Monroe","description":"Public notice is hereby given that the City of Richland, Washington has issued the above solicitation for qualified individuals/firms to provide polygraph examination services as part of the hiring process for emergency dispatchers for the Benton County Emergency Services Southeast Communications Center. The City intends to award a five (5) year contract. Included herein is a call for qualifications for consultants and general requirements. Detailed information and the submittal documents are available at www.publicpurchase.com , under City of Richland, Washington designated webpage. The City of Richland in accordance with Title VI of the Civil Rights Act of 1964, 78 Stat. 252, 42 USC 2000d to 2000d-4 and Title 49, Code of Federal Regulations, Department of Transportation, Subtitle A, Office of the Secretary, Part 21, Nondiscrimination in Federally Assisted Programs of the Department of Transportation issued pursuant to such Act, hereby notifies all bidders that it will affirmatively insure that in any contract entered into pursuant to this advertisement, disadvantaged business enterprises as defined at 49 CFR Part 26 will be afforded full opportunity to submit bids in response to this invitation and will not be discriminated against on the grounds of race, color national origin, or sex in consideration for an award. Americans with Disabilities Act (ADA) Information The City of Richland in accordance with Section 504 of the Rehabilitation Act (Section 504) and the Americans’ with Disabilities Act (ADA), commits to nondiscrimination on the basis of disability, in all of its programs and activities. This material can be made available in an alternate format by emailing Heather Kintzley at hkintzley@ci.richland.wa.us or by calling 509-942-7384."}]