[{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/establishment-portnwsa-tacoma-employee-handbook","title":"Establishment of Port/NWSA of Tacoma Employee Handbook","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"4/7/2023","close_timestamp":1680901200,"state":"WA","agency":"Port of Tacoma","description":"The Port of Tacoma (Port) and Northwest Seaport Alliance (NWSA) are soliciting proposals from qualified contractors (law firms, consultants, or Human Resources professionals) experienced with government agencies to develop an employee handbook, and provide annual handbook review and updates on an ongoing basis to comply with changes in Port/NWSA policies as well as local, state and federal laws and regulations."},{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/call-marine-structures-facility-condition-assessment-services-2023","title":"On-Call Marine Structures Facility Condition Assessment Services 2023-2026","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"4/11/2023","close_timestamp":1681246800,"state":"WA","agency":"Port of Tacoma","description":"The Port of Tacoma (Port) and the Northwest Seaport Alliance (NWSA) are soliciting Statements of Qualifications (SOQ) from highly qualified teams interested in providing professional consulting services to assist the Port and the NWSA On-Call Marine Structures Facility Assessment Services for the South Harbor (Tacoma)."},{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/pct-fender-system-replacement-project","title":"PCT Fender System Replacement Project","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"3/30/2023","close_timestamp":1680210000,"state":"WA","agency":"Port of Tacoma","description":"$1,400,000 to $1,700,000, plus Washington State Sales Tax (WSST)"},{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/blair-waterway-berth-deepening-and-nearshore-habitat-improvement","title":"Blair Waterway Berth Deepening and Nearshore Habitat Improvement","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"4/6/2023","close_timestamp":1680814800,"state":"WA","agency":"Port of Tacoma","description":"The Port of Tacoma (Port) is soliciting Statements of Qualifications (SOQ) from firms qualified and interested in providing professional consulting services in planning, preliminary and final engineering design (civil, structural, coastal, habitat and electrical), geotechnical investigation and design, land and bathymetric survey, cost estimating, scheduling, permitting, project management, environmental support, bidding support and construction support. The Port may apply for federal funding for various phase; Therefore, the contract that results from the RFQ and various work packages may be subject to the Federal Terms and Conditions of each grant. Please see the following attachments when submitting a statement of qualifications, which may be updated per each grant. If we receive a federal grant, the contract will be subject to U.S Department of Transportation General Terms and Conditions under the fiscal year 2021 Port Infrastructure Development Program (PIDP) Grants per section 19."},{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/rfi-zero-emission-drayage-truck-pilot-demonstration-and-incentive","title":"RFI Zero-Emission Drayage Truck Pilot Demonstration and Incentive Program","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"4/20/2023","close_timestamp":1682017200,"state":"WA","agency":"Port of Tacoma","description":"The NWSA has secured a federal CMAQ grant of $2.8 million towards a ZE truck demonstration project in our gateway in 2025. This Request for Information (RFI) seeks information on how to deploy these funds in an effective and equitable way, to provide an opportunity for truck owners to put ZE trucks into operation in our gateway, highlighting key lessons learned for the Pacific Northwest trucking community, the NWSA, and other stakeholders and partners. The goals of the initial demonstration projects include but are not limited to: • Validate Zero Emission Drayage Truck Technology • Increase NWSA and Drayage Fleet’s Understanding of Transition Opportunity • Increase NWSA and Drayage Fleets’ Understanding of the Challenges Associated with Adopting ZE Technologies • Inform the Longer-Term Strategy for Drayage Decarbonization • Generate the Partnerships Required for Success • Explore Support and Incentives for Second-Life Application"},{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/call-nwsa-green-marine-2023-verification-services","title":"On Call NWSA Green Marine 2023 Verification Services","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"3/22/2023","close_timestamp":1679518800,"state":"WA","agency":"Port of Tacoma","description":"The Northwest Seaport Alliance is soliciting proposals for a verifier to review the NWSA’s self-evaluation scores and supporting documentation of Green Marine self-evaluation documentation."},{"site_name":"TacomaPortWA","url":"https://www.portoftacoma.com/business/contracting/procurement/cybersecurity-auditor-2023","title":"Cybersecurity Auditor 2023","login_required":false,"payment_required":false,"open_date":"3/20/2023","open_timestamp":1679284800,"close_date":"3/31/2023","close_timestamp":1680296400,"state":"WA","agency":"Port of Tacoma","description":"The Port of Tacoma is soliciting proposals from firms interested in providing auditor services for cybersecurity (information security). The Port anticipates awarding a 3-year contract to begin May 10, 2023, with two one-year options for renewal at the sole discretion of the Port, for a possible total of five years this contract will not exceed a total of $240,000.00 ($80,000.00 annually)."}]