[{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/82509","title":"RFP-033-23-CD - Banking Services for the City of Tallahassee, FL","login_required":false,"payment_required":false,"open_date":"12/30/2022","open_timestamp":1672430400,"close_date":"3/21/2023","close_timestamp":1679414400,"state":"FL","agency":"City of Tallahassee","description":"The City of Tallahassee (the City) requests proposals to provide the City’s banking services. The intent of this proposal process is to select one primary bank to provide all banking services as outlined in this request for proposal. The City’s objective is to: Obtain banking services economically and efficiently. Maximize earnings on public funds deposited locally; and Maximize use of technology to enhance efficiency in the City’s banking program. To receive consideration, at a minimum, the proposer shall thoroughly document the bank’s ability to meet all of the following requirement qualification criteria: (a) The proposer must be a commercial bank, certified by the State of Florida, Bureau of Collateral Securities, Division of Treasury, as a “Qualified Public Depository” pursuant to the provision of the Florida Security for Public Deposits Act as described in Chapter 280, Florida Statutes. (b) The proposer must be a full-service commercial bank with multiple branch locations within the City of Tallahassee. (c) The proposer must have the capability of performing all of the required duties specified in this REQUEST FOR PROPOSAL. (d) The proposer must have available an adequate number of qualified staff to provide the services specified in this REQUEST FOR PROPOSAL. (e) The proposer must be able to provide full-service web-based banking products and balance reporting services. (f) The proposer must have the ability to export or download Account Reconcilement Plan (ARP) reports (both outstanding and cleared checks) in Excel. (g) Incoming wire transfers must have same day availability. (h) Honor all checks drawn upon City accounts should the City experience an overdraft in that particular account."},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/81134","title":"RFSQ-025-23-CG - Fire Line Backflow Assembly Plumbing Services","login_required":false,"payment_required":false,"open_date":"2/27/2023","open_timestamp":1677528000,"close_date":"3/23/2023","close_timestamp":1679594400,"state":"FL","agency":"City of Tallahassee","description":"Fire Line Backflow Assembly Pluming Services. Vendors must possess a backflow testing certification and a fire sprinkler license in order to qualify."},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/83759","title":"IFB-043-23-AP - Taxiway A South Rehabilitation","login_required":false,"payment_required":false,"open_date":"2/20/2023","open_timestamp":1676912400,"close_date":"3/23/2023","close_timestamp":1679596200,"state":"FL","agency":"City of Tallahassee","description":"Rehabilitation of Taxiway A South which is the parallel taxiway to Runway 18-36. Work includes, milling, pavement removal, grading, drainage, turfing, and airfield electrical work."},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/87062","title":"IFB-051-23-AP - Non-Destructive Testing for The Electric Generation Stations","login_required":false,"payment_required":false,"open_date":"2/20/2023","open_timestamp":1676912400,"close_date":"3/23/2023","close_timestamp":1679596200,"state":"FL","agency":"City of Tallahassee","description":"The City of Tallahassee, Florida (“City”), invites prospective bidders to submit bids to provide Non-Destructing Testing Services for the Electric Generating Stations as specified in this solicitation. The Purdom Generating Station is located south of Tallahassee, at 667 Port Leon Drive, St. Marks, Florida in Wakulla County, Florida, on Highway 363. The Hopkins Generating Station is located west of Tallahassee, at 1125 Geddie Road, Tallahassee, FL in Leon County, Florida, on County Road 1585 (Geddie Road). MANDATORY PREBID MEETING/SITE VISITS: MARCH 2, 2023 @ 10AM 2 locations starting at Hopkins Generation Station-1125 Geddie Road, Tallahassee, FL; then to Purdom Generation Station-667 Port Leon Drive St. Marks, FL @ 12PM INTERESTED VENDORS MUST ATTEND BOTH SITE VISITS."},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/82272","title":"RFP-029-23-CG - Energy Commodities Brokerage and Consulting Services","login_required":false,"payment_required":false,"open_date":"3/7/2023","open_timestamp":1678221000,"close_date":"3/28/2023","close_timestamp":1680026400,"state":"FL","agency":"City of Tallahassee","description":"Energy Commodities Brokerage and Consulting Services"},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/83567","title":"IFB-039-23-CD - REBID StarMetro CK Steele Concrete Project","login_required":false,"payment_required":false,"open_date":"3/9/2023","open_timestamp":1678401000,"close_date":"4/4/2023","close_timestamp":1680633000,"state":"FL","agency":"City of Tallahassee","description":"The City of Tallahassee, StarMetro, is seeking out a contractor to clean out all the concrete joints at CK Steele Plaza and put back new backer-rod and new caulk in every expansion and control joint. All existing joint sealant materials shall be removed and cleaned out by sand blasting, grinding or other approve methods and prepped for new backer-rod and new caulk. The intent is that all joints in the pavement surface be sealed to provide a complete system to eliminate the penetration of water through the surface of the pavement. The sealant that will be used is DOWSIL 890-SL. Color: Dark Gray. FEDERAL CLAUSES APPLY FOR THIS PROJECT, BIDDERS MUST COMPLY WITH BUILD AMERICA, BUY AMERICA (BABA)"},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/88068","title":"IFB-055-23-AP - Laundry, Dry Cleaning, Alterations Repair of Uniforms and Plain Clothes","login_required":false,"payment_required":false,"open_date":"3/6/2023","open_timestamp":1678109400,"close_date":"4/4/2023","close_timestamp":1680633000,"state":"FL","agency":"City of Tallahassee","description":"The City of Tallahassee Police Department and Fire Department are seeking to execute a contract with a qualified vendor for laundry, dry cleaning, alteration, and repair services for uniforms and plain clothes apparel."},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/87406","title":"IFB-053-23-AP - Electrical Breaker & Protective Relay Services","login_required":false,"payment_required":false,"open_date":"Invalid Date","open_timestamp":null,"close_date":"4/13/2023","close_timestamp":1681410600,"state":"FL","agency":"City of Tallahassee","description":"The City of Tallahassee is seeking bids that covers the requirements for the teardown, inspection, and maintenance of draw-out type circuit breakers in service at the A. B. Hopkins, and Sam O. Purdom Generating Stations owned and operated by the City of Tallahassee. Two Mandatory Pre Bid Meetings is held March 8, 2023 at 10:00am at Hopkins and 12:00pm at Purdom. See details in the solicitation and see schedule below"},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/84062","title":"RFSQ-045-23-KM - PROFESSIONAL SERVICES FOR THE SOUTHSIDE TRIANGLE WATER AND SEWER IMPROVEMENTS PROJECT","login_required":false,"payment_required":false,"open_date":"3/17/2023","open_timestamp":1679076000,"close_date":"4/18/2023","close_timestamp":1681840800,"state":"FL","agency":"City of Tallahassee","description":"FOR CHARLES HARGRAVES, UUPI"},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/85210","title":"IFB-047-23-AP - Taxiway B South Rehabilitation","login_required":false,"payment_required":false,"open_date":"3/17/2023","open_timestamp":1679070600,"close_date":"4/18/2023","close_timestamp":1681842600,"state":"FL","agency":"City of Tallahassee","description":"The City of Tallahassee requires General Contracting and Construction Services for the Taxiway B Rehabilitation at Tallahassee International Airport and is seeking a qualified contractor interested in providing all services, labor, materials, equipment and supplies necessary to provide such products and/or services as outlined in this document. MANDATORY PRE-BID MEETING AND SITE VISIT March 28, 2023 10am @ Airport Boeing Training Room {2nd Floor Terminal Building}"},{"site_name":"TallahasseeFL","url":"https://talgov.bonfirehub.com/opportunities/87322","title":"IFB-052-23-AP - Runway 18-36 Rehabilitation","login_required":false,"payment_required":false,"open_date":"3/10/2023","open_timestamp":1678503600,"close_date":"4/18/2023","close_timestamp":1681842600,"state":"FL","agency":"City of Tallahassee","description":"Rehabilitation of Runway 18-36 includes, milling, asphalt paving, grading, drainage, turfing, striping and airfield electrical work and signage. MANDATORY Pre-bid Meeting / Site Visit LOCATION: Airport Boeing Training Room (2nd Floor Terminal Building) Tuesday, March 21, 2023 @ 1:00 PM to 2:00 PM"}]