[{"site_name":"WauwatosaWI","url":"https://www.wauwatosa.net/Home/Components/RFP/RFP/206/403?selsta=4","title":"City of Wauwatosa-Request for Proposal - Procurement of Fiber Materials","login_required":false,"payment_required":false,"open_date":"3/16/2023","open_timestamp":1678939200,"close_date":"4/5/2023","close_timestamp":1680667200,"state":"WI","agency":"City of Wauwatosa","description":"CITY OF WAUWATOSA PURCHASING DEPARTMENT REQUEST FOR PROPOSALS Procurement of Fiber Infrastructure Materials OFFICIAL NOTICE PROPOSALS REQUESTED: Formal proposals will be received, per the instructions below, until 11:01 AM. on Wednesday, April 5, 2023. Proposals received in response to this request will be forwarded to the Wauwatosa City Engineer for evaluation and consideration. NOTE: This is not a pubic bid opening. The City of Wauwatosa is seeking formal sealed proposals from qualified material vendors (referred to as “Vendor”, “Firm”, or “Contractor”) to provide pricing for various materials for build out of the City of Wauwatosa’s fiber network. The City will order materials from vendors awarded on a price, convenience, and availability basis. Materials are to be delivered to 11100 W. Walnut St., Wauwatosa, WI 53226 in accordance with the City of Wauwatosa Request for Proposal dated March 16, 2023 and this Official Notice. Proposal documents will be available via download only from the City of Wauwatosa. Please contact the City of Wauwatosa Purchasing Department at lschleimer@wauwatosa.net or by phone at (414) 479-8958 to obtain proposal documents. All requests will be fulfilled via email. PROPOSAL SUBMITTAL Proposals submitted are to be a single PDF delivered via email to Laurie Schleimer, Purchasing Coordinator at lschleimer@wauwatosa.net , Please include “Proposal for Procurement of Fiber Infrastructure Materials” in the subject line when submitting your response. Only the Bid Form in Appendix A of the RFP needs to be returned. PROPOSAL TIME SCHEDULE: Listed below are estimated dates and times of actions related to this RFP: • RFP Issued: Thursday, March 16, 2023 • Questions on RFP Due: Monday, March 27, 2023 by 12:00 PM • Answers to Questions to RFP Holders: Tuesday, March 28, 2023 by 1:00 PM • Proposals Due: Wednesday, April 5, 2023 at 11:01 AM. No proposal shall be withdrawn after the opening of proposals for a period of thirty (30) days after the scheduled time of closing of proposals. It is the intent to award to qualified vendors submitting bids and the City will procure individual materials from vendors on a price and availability basis as needed for the build out of the City’s infrastructure. Submitted pricing shall be valid for 30 calendar days from award. The City of Wauwatosa reserves the right to reject any and all proposals received or, at its option, may select the proposal(s) deemed to be most responsive and in the best interests of the City. The City of Wauwatosa reserves the right to negotiate specifications, terms and conditions which may be necessary or appropriate to the accomplishment of the purpose of this RFP. Proposer certifies that their proposal has been made without connection to any other vendor and is, in all respects, fair and without collusion or fraud, and is made with the understanding that no elected official or Wauwatosa City employee has an interest, directly or indirectly, unless otherwise stated. PATENTED DEVICES, EQUIPMENT AND PROCESSES: It is understood and agreed that without exception, bid prices include all royalties and costs arising from patents, trademarks, and copyrights. The successful bidder shall, in all cases, indemnify and save harmless the City of Wauwatosa from any and all claims for infringement by reason of the use of any such patented design, device, material, or process to be used or delivered, and shall indemnify the said City of Wauwatosa for any cost, expense, and damage which it may be obliged to pay by reason of such infringement, at any time during or after delivery. Questions concerning this proposal request will be received through Monday, March 27, 2023 by 12:00 PM. Please include “Proposal for Procurement of Fiber Infrastructure Materials” in the subject line. When deemed relevant, responses to questions received will be distributed to all RFP holders of record by 1:00 PM on Tuesday, March 28, 2023. Vendors are not permitted to contact individual City Council members or other City Staff for clarification of the RFP. Any such contact may disqualify the consultant from evaluation. Dated: March 16, 2023 Wauwatosa, Wisconsin"},{"site_name":"WauwatosaWI","url":"https://www.wauwatosa.net/Home/Components/RFP/RFP/204/403?selsta=4","title":"City of Wauwatosa- Request for Qualifications/Proposals Design Services-Pavement Replacement of North Avenue, 95th St to 73 St and Replacement of North Avenue Bridge","login_required":false,"payment_required":false,"open_date":"3/10/2023","open_timestamp":1678424400,"close_date":"4/7/2023","close_timestamp":1680840000,"state":"WI","agency":"City of Wauwatosa","description":"CITY OF WAUWATOSA PURCHASING DEPARTMENT REQUEST FOR QUALIFICATIONS / REQUEST FOR PROPOSALS Design Services – Pavement Replacement of North Avenue, 95th St to 73rd St WI DOT 2135-15-00-70 Replacement of North Avenue Bridge B40-998 DOT ID 2135-05-01/71 B40-999 DOT ID 2135-05-02/72 OFFICIAL NOTICE REQUEST FOR QUALIFICATION PROPOSALS REQUESTED: Formal proposals, One (1) electronic copy (single pdf) delivered via email will be received until 5:01 PM, Friday, April 7, 2023 per the instructions in the Request for Proposal document. Submittals received will be forwarded to an internal selection team for review to determine a shortlist of consultants to proceed to the Request for Proposal phase of this solicitation. This is not a public bid opening. The City of Wauwatosa is requesting proposals from approved WISDOT (Wisconsin Department of Transportation) consultants to provide design services for the repaving of North Avenue from 95th St to 73rd St, including the replacement of the two North Ave bridges over the Menomonee River. Included in the design will be spot geometric improvements, traffic signals, street lighting, storm sewer, water main and sanitary sewer relays, TPP plat and survey. Formal WISDOT approval requires consultants to have completed a Consultant Report, WISDOT Form DT1538, and be actively included on the WISDOT roster of eligible engineering consultants (FDM 8-5-45). This contract will be a three-party contract with WisDOT and the City of Wauwatosa. The design will require the selected consultant to work with multiple City, County and State agencies, as well as, members of the Community. The pavement replacement project currently has a December 8, 2026 Let date and the bridges currently have a February 9, 2027 Let date. The city is working with DOT to combine these three DOT projects into a single let with the PSE package due November 1, 2026 Copies of the Request for Qualifications and Proposal may be obtained by contacting Laurel Schleimer, at lschleimer@wauwatosa.net All requests for documents will be fulfilled via email only. Listed below are estimated dates and times of actions related to this RFP: • March 10, 2023 Release RFP • March 23, 2023 Clarifications/Questions due 12:00 PM • March 30, 2023 Answers to questions received sent to plan holders by 4:00 PM • April 7, 2023 Qualification Proposals due at 4:30 PM Proposer certifies that their proposal has been made without connection to any other vendor and is, in all respects, fair and without collusion or fraud, and is made with the understanding that no elected official or Wauwatosa City employee has an interest, directly or indirectly, unless otherwise stated. PATENTED DEVICES, EQUIPMENT AND PROCESSES: It is understood and agreed that without exception, bid prices include all royalties and costs arising from patents, trademarks, and copyrights. The successful bidder shall, in all cases, indemnify and save harmless the City of Wauwatosa from any and all claims for infringement by reason of the use of any such patented design, device, material, or process to be used or delivered, and shall indemnify the said City of Wauwatosa for any cost, expense, and damage which it may be obliged to pay by reason of such infringement, at any time during or after delivery. The City of Wauwatosa reserves, exclusively to itself, the right to reject any or all proposals, or to accept the proposal deemed most advantageous to the City and to waive any or all technicalities or informalities in submitted proposals. No alterations or modifications to bids shall be allowed after bid opening. Dated: March 10, 2023 Wauwatosa, Wisconsin"},{"site_name":"WauwatosaWI","url":"https://www.wauwatosa.net/Home/Components/RFP/RFP/202/403?selsta=4","title":"City of Wauwatosa RFQ Design Services - Pavement Replacement of STH 181 - Wisconsin Avenue to Center Street; WI DOT 2160-06-01/71","login_required":false,"payment_required":false,"open_date":"3/7/2023","open_timestamp":1678165200,"close_date":"3/31/2023","close_timestamp":1680235200,"state":"WI","agency":"City of Wauwatosa","description":"CITY OF WAUWATOSA PURCHASING DEPARTMENT REQUEST FOR QUALIFICATIONS / REQUEST FOR PROPOSALS Design Services – Pavement Replacement of STH 181 – Wisconsin Ave to Center St WI DOT 2160-06-01/71 Wauwatosa CIP Project No. 1121 OFFICIAL NOTICE REQUEST FOR QUALIFICATION PROPOSALS REQUESTED: Formal proposals, One (1) unbound original and one electronic copy (no emails please) will be received until 4:30 PM, Friday, March 31, 2023 the City of Wauwatosa Purchasing Manager, at 7725 W North Avenue, Wauwatosa, WI 53213. Submittals received will be forwarded to an internal selection team for review to determine a shortlist of consultants to proceed to the Request for Proposal phase of this solicitation. This is not a public bid opening. The City of Wauwatosa is requesting proposals from approved WISDOT (Wisconsin Department of Transportation) consultants to provide design services for the pavement replacement of STH 181 (Glenview Ave, Harwood Ave, Harmonee Ave & Wauwatosa Ave) from approximately Wisconsin Avenue to Center Street. The segment between Milwaukee Avenue and Garfield Avenue that was repaved in 2020 will be omitted within the project limits. Included in the design will be spot geometric improvements, bridge rehabilitation work, traffic signals, street lighting, storm sewer, water main relay, sanitary sewer relay, TPP plat and survey. Formal WISDOT approval requires consultants to have completed a Consultant Report, WISDOT Form DT1538, and be actively included on the WISDOT roster of eligible engineering consultants (FDM 8-5-45). This contract will be a three-party contract with WisDOT and the City of Wauwatosa. The design will require the selected consultant to work with multiple City, County and State agencies, as well as, members of the Community. This project has a September 14, 2027 Let date with the PSE package due August 1, 2026 The goals of this project include: Copies of the Request for Qualifications and Proposal may be obtained by contacting Laurel Schleimer, at lschleimer@wauwatosa.net All requests for documents will be fulfilled via email only. Listed below are estimated dates and times of actions related to this RFP: • March 7, 2023 Release RFP • March 17, 2023 Clarifications/Questions due 12:00 PM • March 22, 2023 Answers to questions received sent to plan holders by 4:00 PM • March 31, 2023 Qualification Proposals due at 4:30 PM Proposer certifies that their proposal has been made without connection to any other vendor and is, in all respects, fair and without collusion or fraud, and is made with the understanding that no elected official or Wauwatosa City employee has an interest, directly or indirectly, unless otherwise stated. PATENTED DEVICES, EQUIPMENT AND PROCESSES: It is understood and agreed that without exception, bid prices include all royalties and costs arising from patents, trademarks, and copyrights. The successful bidder shall, in all cases, indemnify and save harmless the City of Wauwatosa from any and all claims for infringement by reason of the use of any such patented design, device, material, or process to be used or delivered, and shall indemnify the said City of Wauwatosa for any cost, expense, and damage which it may be obliged to pay by reason of such infringement, at any time during or after delivery. The City of Wauwatosa reserves, exclusively to itself, the right to reject any or all proposals, or to accept the proposal deemed most advantageous to the City and to waive any or all technicalities or informalities in submitted proposals. No alterations or modifications to bids shall be allowed after bid opening. Dated: March 7, 2023 Wauwatosa, Wisconsin"},{"site_name":"WauwatosaWI","url":"https://www.wauwatosa.net/Home/Components/RFP/RFP/200/403?selsta=4","title":"City of Wauwatosa - Lead Service Line Replacement Plan","login_required":false,"payment_required":false,"open_date":"3/6/2023","open_timestamp":1678078800,"close_date":"3/31/2023","close_timestamp":1680235200,"state":"WI","agency":"City of Wauwatosa","description":"CITY OF WAUWATOSA PURCHASING DEPARTMENT REQUEST FOR PROPOSALS Professional Services for a Full Lead Service Line Replacement Plan In accordance with the EPA Lead and Copper Rule Revisions and WDNR Requirements OFFICIAL NOTICE PROPOSALS REQUESTED: Formal proposals will be received, per the instructions below, until 1:01 P.M. on March 31, 2023. Proposals received in response to this request will be forwarded to the City’s Director of Public Works for evaluation and consideration. NOTE: This is not a pubic bid opening. The City of Wauwatosa, Wisconsin is soliciting engineering consulting proposals to prepare a Full Lead Service Line replacement program, assist with application of grants, and evaluation of the City’s existing service line material inventory. The written replacement program and material inventory, upon completion, will both be submitted to the Wisconsin Department of Natural Resources (WDNR) for their review and, ultimately, their approval. The Federal Lead and Copper Rule Revisions requires that utilities with known Lead Service Line’s (LSL) have a WDNR approved plan and service material inventory. The City is looking to submit both to the WDNR in late 2023/early 2024, All in accordance with the City of Wauwatosa Request for Proposal dated March 6, 2023 and this Official Notice. Copies of the contract documents may be obtained by contacting the City of Wauwatosa Purchasing Department Office, at lschleimer@wauwatosa.net . All requests for documents will be fulfilled via email only. PRE-PROPOSAL MEETING & QUESTIONS A non-mandatory pre-proposal meeting will be held on Friday, March 17, 2023 at 11:00 AM. Attendees may participate either in person, at Wauwatosa City Hall, Committee Room #1, or via Zoom. Zoom participants can join by visiting https://www.zoom.us/join and then enter Meeting ID 854 3158 5402. All questions outside of the pre-proposal meeting shall be directed via email to David Simpson, dsimpson@wauwatosa.net, and Adam Florin, aflorin@wauwatosa.net no later than noon, Wednesday, March 22, 2023 with the anticipation that responses to questions will be given no later than 3:00 PM, on Friday, March 24th at 4:00 PM. PROPOSAL SUBMITTAL Proposal responses are due no later than 1:01 PM, Friday, March 31, 2023. Proposals are to be a single PDF delivered via an email titled “Proposal for Professional Services-Lead Service Line Replacement Plan” to Laurie Schleimer, Purchasing Coordinator, lschleimer@wauwatosa.net and to Dave Simpson, Director of Public Works at dsimpson@wauwatosa.net The City’s email system will not accept files larger than 10MB, if your proposal exceeds that limit please provide your submission via a digital drop box or FTP of your choosing and provide download instructions in your submission email. PROPOSAL TIME SCHEDULE: Listed below are estimated dates and times of actions related to this RFP: • Proposal Release Date - March 6, 2023 • Pre-proposal Meeting- March 17th, 2023 at 11:00am. • Questions Due- March 22nd, 2023 at noon • Answers to Questions Received – March 24th, 2023 at 4:00 pm • Proposals due - March 31st, 2023 at 1:01 PM • Tentative Consultant Interviews (if deemed necessary) April 10-11, 2023 • Consideration of award by Common Council May 2nd, 2023 Proposer certifies that their proposal has been made without connection to any other vendor and is, in all respects, fair and without collusion or fraud, and is made with the understanding that no elected official or Wauwatosa City employee has an interest, directly or indirectly, unless otherwise stated. The City of Wauwatosa reserves, exclusively to itself, the right to reject any or all proposals or to accept the proposal deemed most advantageous to the City and to waive any, or all, technicalities or informalities in submitted proposals. No proposals, alterations, or modifications to proposals shall be allowed after the official date of submission. PATENTED DEVICES, EQUIPMENT AND PROCESSES: It is understood and agreed that without exception, bid prices include all royalties and costs arising from patents, trademarks, and copyrights. The successful bidder shall, in all cases, indemnify and save harmless the City of Wauwatosa from any and all claims for infringement by reason of the use of any such patented design, device, material, or process to be used or delivered, and shall indemnify the said City of Wauwatosa for any cost, expense, and damage which it may be obliged to pay by reason of such infringement, at any time during or after delivery. Consultants are not permitted to contact individual City Council members or other City staff for clarification of the RFP. Dated: March 6, 2023 Wauwatosa, Wisconsin"}]